In [1]:
import pandas as pd

In [2]:
data = [(1, 2, 3, 4),
        (5, 6, 7, 8),
        (8, 10, 11, 12),
        (13, 14, 15, 16)]
df = pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split())

In [3]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [4]:
#criando uma series de uma coluna
df['c1']

l1     1
l2     5
l3     8
l4    13
Name: c1, dtype: int64

In [6]:
#um df com duas colunas
df[['c3', 'c1']]

    c3  c1
l1   3   1
l2   7   5
l3  11   8
l4  15  13

In [7]:
#seleção por linhas - a partir da segunda linha
df[1:]

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [8]:
#um limite entre linhas (posição 1 e posição 2 no caso)
df[1:3]

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12

In [9]:
#mais uma notação, usando linhas e colunas
df[1:][['c3', 'c1']]

    c3  c1
l2   7   5
l3  11   8
l4  15  13

In [10]:
#usando o .loc() - usando os rótulos das linhas - criou uma series com as colunas
df.loc['l3']

c1     8
c2    10
c3    11
c4    12
Name: l3, dtype: int64

In [12]:
#selecionando mais de uma linha
df.loc[['l3','l2']]

    c1  c2  c3  c4
l3   8  10  11  12
l2   5   6   7   8

In [15]:
#retornando o valor de uma 'célula' com as coordenadas
df.loc['l1', 'c2']

2

In [16]:
#usando os índices numéricos com iloc
df.iloc[0,1]

2

In [17]:
# criando um grupo de linhas e um grupo de colunas
df.loc[['l3','l1'], ['c4', 'c1']]

    c4  c1
l3  12   8
l1   4   1

In [18]:
#mesma coisa com índices
df.iloc[[2,0], [3,0]]

    c4  c1
l3  12   8
l1   4   1